[
      {
            "url": "https://en.wikipedia.org/wiki/Timeline_of_Indian_history",
            "paragraph": "\n This is a timeline of Indian history comprising important legal and territorial changes\nand political events in India and its predecessor states. To read about the background\nto these events see History of India.  See also the list of governors-general\nof India list of prime ministers of India and Years in India.\n \n Evidence for presence of Hominins with Acheulean technology 1500000–100000 BCE in Tamil Nadu.\n Madrasian culture sites have been found in Attirampakkam (Attrambakkam=13° 13' 50\" 79\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/History_of_India",
            "paragraph": "\n According to consensus in modern genetics anatomically modern humans first arrived on the\nIndian subcontinent from Africa between 73000 and 55000 years ago.1  However the earliest\nknown human remains in South Asia date to 30000 years ago.  Settled life\nwhich involves the transition from foraging to farming and pastoralism began in South Asia\naround 7000 BCE.  At the site of Mehrgarh presence can be documented of\nthe domestication of wheat and barley rapidly followed by that of goats sheep and\n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/2021_in_India",
            "paragraph": "\n ←\n →\n Events in the year 2021 in India\n Chairman of Rajya Sabha\n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/2021_in_India#Government_of_India",
            "paragraph": "\n ←\n →\n Events in the year 2021 in India\n Chairman of Rajya Sabha\n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/2021_in_India#Events",
            "paragraph": "\n ←\n →\n Events in the year 2021 in India\n Chairman of Rajya Sabha\n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/2021_in_India#June",
            "paragraph": "\n ←\n →\n Events in the year 2021 in India\n Chairman of Rajya Sabha\n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/2021_in_India#July",
            "paragraph": "\n ←\n →\n Events in the year 2021 in India\n Chairman of Rajya Sabha\n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/History_of_India_(1947%E2%80%93present)",
            "paragraph": "\n The history of independent India began when the country became an independent nation\nwithin the British Commonwealth on 15 August 1947. Direct administration by the British which\nbegan in 1858 affected a political and economic unification of the subcontinent. When British\nrule came to an end in 1947 the subcontinent was partitioned along religious lines\ninto two separate countries—India with a majority of Hindus and Pakistan with a majority\nof Muslims.1 Concurrently the Muslim-majority northwe\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/Category:Historical_events_in_India",
            "paragraph": "This category has the following 25 subcategories out of 25 total.\n The following 2 pages are in this category out of  2 total.\nThis list may not reflect recent changes (learn more).\n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/India",
            "paragraph": "\n India officially the Republic of India (Hindi: Bhārat Gaṇarājya)24 is a country in\nSouth Asia. It is the seventh-largest country by area the second-most populous country and\nthe most populous democracy in the world. Bounded by the Indian Ocean on the\nsouth the Arabian Sea on the southwest and the Bay of Bengal on the\nsoutheast it shares land borders with Pakistan to the west;f China Nepal and Bhutan\nto the north; and Bangladesh and Myanmar to the east. In the Indian Ocean\nIndia is in the vicin\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/2020_in_India",
            "paragraph": "\n ←\n →\n Events in the year 2020 in India.\n Chairman of Rajya Sabha\n \n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/2019_in_India",
            "paragraph": "\n ←\n →\n Events from the year 2019 in India.\n Chairman of Rajya Sabha\n \n 17 June – Tabrez Ansari lynching: 24-year-old Tabrez Ansari was attacked by a\nHindu lynch mob in Jharkhand India. Ansari a Muslim was tied to a tree\nbrutally beaten and forced to chant Hindu religious slogans. He died four days later.\n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/Category:History_of_India",
            "paragraph": "This category has the following 25 subcategories out of 25 total.\n The following 170 pages are in this category out of  170 total.\nThis list may not reflect recent changes (learn more).\n This category contains only the following file.\n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/Category:Indian_history_timelines",
            "paragraph": "This category has the following 3 subcategories out of 3 total.\n The following 17 pages are in this category out of  17 total.\nThis list may not reflect recent changes (learn more).\n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/2018_in_India",
            "paragraph": "\n ←\n →\n Events in the year 2018 in the Republic of India.\n Chairman of Rajya Sabha\n Following elections were scheduled to take place in various states of the country\n India vs Australia test series 2018\n In Men's Hockey World Cup 2018 Belgium won the tournament for the first\ntime after defeating the Netherlands 3–2 in the final on a penalty shoot-out after\na 0–0 draw. Defending champions Australia won the third place match by defeating England\n8–1.4\n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/British_Raj",
            "paragraph": "\n The British Raj (/rɑːdʒ/; from Hindi rāj: kingdom realm state or empire.2a) was\nthe rule of the British Crown on the Indian subcontinent from 1858 to 1947.4567\nThe rule is also called Crown rule in India8 or direct rule in India.9\nThe region under British control was commonly called India in contemporaneous usage and included\nareas directly administered by the United Kingdom which were collectively called British India and\nareas ruled by indigenous rulers but under British paramountcy called t\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/1921_in_India",
            "paragraph": "\n ←\n →\n Events in the year 1921 in India.\n \n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/1962_in_India",
            "paragraph": "\n ←\n →\n The following lists events that happened during 1962 in the Republic of India.\n \n This Indian history-related article is a stub. You can help Wikipedia by expanding\nit.\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/1934_in_India",
            "paragraph": "←\n →\n Events in the year 1934 in India.\n\n"
      },
      {
            "url": "https://en.wikipedia.org/wiki/1948",
            "paragraph": "\n 1948 (MCMXLVIII) was a leap year starting on Thursday of the Gregorian calendar\nthe 1948th year of the Common Era (CE) and Anno Domini (AD) designations the\n948th  year of the 2nd millennium the 48th  year of the 20th century and\nthe  9th   year of the 1940s decade. \n"
      }
]